var store = [{
        "title": "C++ - JPL DE430 データから太陽・月の視位置を計算！",
        "excerpt":"NASA の機関である JPL(Jet Propulsion Laboratory) が惑星探査用に編纂・発行している太陽・月・惑星の暦の最新版 DE430 には太陽・月・惑星の位置（ICRS座標系）の情報が格納されています。 それらの値を使用して、太陽・月・その他惑星の任意の2天体間の距離を C++ で計算してみました。 過去には Ruby で行っています。 Ruby - JPL 天文暦データから地球と惑星の距離を計算！ 0. 前提条件 Debian GNU/Linux 10.8 (64bit) での作業を想定。 GCC 10.2.0 (G++ 10.2.0) (C++17) でのコンパイルを想定。 1. 天文暦バイナリデータについて 当ブログ過去記事を参照のこと。 JPL 天文暦データのバイナリ化！ C++ - JPL 天文暦バイナリデータの読み込み！ C++ - JPL 天文暦データから ICRS 座標を計算！ また、天文暦データには各種バージョンが存在するが、日本の国立天文台が現在使用している DE430 を当方も採用する。 2....","categories": ["プログラミング","暦・カレンダー"],
        "tags": ["C++","カレンダー"],
        "url": "/2021/04/21/cpp-distance-between-2-celestial-bodies/",
        "teaser": null
      }]
